using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Csharp_autocodegrader.A系列其他
{
    internal class A0006
    {
        static void Main(string[] args)
        {
            double[] da = { 1.532, 61.073, 81.344, 52.489, 62.022, 45.488, 44.110, 36.523, 77.430, 34.931, 2.024, 29.883, 35.584, 56.940, 56.673, 26.782, 21.914, 75.498, 51.175, 50.287, 62.996, 29.256, 60.665, 47.417, 40.707, 99.057, 8.522, 23.278, 91.154, 41.817, 49.653, 80.027, 66.111, 72.725, 99.258, 51.220, 96.581, 84.236, 18.919, 11.354, 20.251, 96.344, 65.535, 28.732, 83.241, 38.545, 77.845, 4.212, 68.298, 65.013, 7.637, 70.258, 88.296, 13.032, 92.077, 72.275, 0.408, 33.927, 11.781, 62.964, 36.966, 20.832, 45.369, 35.614, 85.278, 21.997, 63.773, 62.859, 57.682, 5.454, 30.200, 37.678, 56.579, 39.821, 30.036, 66.653, 63.721, 31.932, 64.175, 2.162, 21.212, 4.310, 54.980, 26.141, 34.180, 79.395, 91.731, 53.079, 80.648, 26.983, 50.812, 62.654, 72.454, 55.954, 74.388, 99.419, 50.974, 29.921, 43.454, 61.244 };

            // your codes here
            // 1. 宣告一個變數 sum 來儲存總和，初始值為 0
            double sum = 0;

            // 2. 使用 foreach 迴圈，把陣列 da 裡面的每一個數字 (num) 加到 sum 裡面
            foreach (double num in da)
            {
                sum += num;
            }

            // 輸出結果 (題目的 :0.000000 代表強制顯示到小數點後六位)
            Console.WriteLine($"The sum of the numbers is:{sum:0.000000}");
            Console.ReadLine();
        }
    }
}
